{"data":{"site":{"siteMetadata":{"title":"Creatures 👹🛴","author":"Joshua Sheridan"}},"markdownRemark":{"id":"b1dd3706-68b8-5dc5-a680-ebaef8153eed","excerpt":"🖼️ Front End Guide This guide roughly covers the process of creating the graphic style for an app and developing the logic of the interface…","html":"<h1>🖼️ Front End Guide</h1>\n<p>This guide roughly covers the process of creating the graphic style for an app and developing the logic of the interface for the app.  <del>Design and code</del> <del><em>probably</em></del> <del>should be treated separately however when working by myself on personal projects, I tend to design while I code.</del> </p>\n<p> Consider this “guide” as part project overview, part blog post</p>\n<p>The following “guide” is meant to explain the choices I made in the process of developing Creatures. The guide is <strong>not</strong> meant to explain in exhaustive detail the problems involved and how to resolve them.  For a guide that does cover setting up a serverless application in exhaustive detail I recommend the <a href=\"https://serverless-stack.com\">Severless Stack Guide</a>, it’s great. </p>\n<h1>😡 Challenges</h1>\n<p>Tackling the design and logic for my front end is essentially a process of trying to figure out what is the personalty of my app and how will users interact with it. The following are some of the questions and tasks I wrote out to help me to figure out the project. In general the project followed a path from design to development to testing.</p>\n<p><del>By writing out a series of questions before starting on the design helped me to consider the project as a whole.</del></p>\n<h2>🎨 Design</h2>\n<ul>\n<li>\n<p>Branding </p>\n<ul>\n<li>Are there terms your users need to learn?</li>\n<li>Does your app have some internal lingo?</li>\n<li>What is your catch phrase or slogan? do you need one?</li>\n<li>\n<p>What is your app’s personality? </p>\n<ul>\n<li>Serious, Slick, Fun, Quirky, Stupid etc..?</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>\n<p>Design</p>\n<ul>\n<li>What are your app’s colors?</li>\n<li>\n<p>Is there a design principle behind your color choices?</p>\n<ul>\n<li>Monochromatic, Complementary, Analogous, etc. </li>\n</ul>\n</li>\n<li>Is there a theme to your app?</li>\n<li>How does your theme relate to scooters?</li>\n<li>\n<p>What is your logo and how does it relate to your theme, color, branding? </p>\n<h2>👩‍💻 Development</h2>\n</li>\n</ul>\n</li>\n<li>Do I want to create a web app? or create a mobile app? </li>\n<li>Fill website with content / answer our user’s questions.</li>\n<li>Handle user login - Authorization flow</li>\n<li>Accept Payments - Payment flow</li>\n<li>\n<p>Decide on Approach</p>\n<ul>\n<li>\n<p>Will I use any existing front end frameworks / libraries to help with the logic of my app?</p>\n<ul>\n<li>React, Angular, Vue, etc.</li>\n</ul>\n</li>\n<li>\n<p>What existing resources will I use to help with the design of my app? </p>\n<ul>\n<li>Bootstrap, Blueprint, etc</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<ul>\n<li>\n<p>Practical Matters</p>\n<ul>\n<li>Registering for a domain </li>\n<li>\n<p>Deploying to the web</p>\n<h2>💣 Testing</h2>\n</li>\n</ul>\n</li>\n<li>Poke your website, see where it breaks</li>\n<li>Is your website responsive?</li>\n<li>\n<p>Does it work on most browsers</p>\n<h1>🤔 Solutions How I approached the problem</h1>\n<h2>🎨 Design</h2>\n</li>\n</ul>\n<p>Before starting work on the design, I had rough idea in my head on how I wanted to approach the design. I knew that I want the design to be fun and to be fun to make. I did not want the design to at all seem corporate, slick, or minimal. I want the design to be arty, illustrative and kind of weird. Keeping with weird, the idea that I came up with is that each scooter would be a unique “creature” and that users would discover them out in the wild. (sort of like Pokemon meets Bird scooter app). Each scooter would be paired with a creature illustration and brief background story. <del>Thus</del> <a href=\"https://creature-share.com/\"><del>Creatures</del></a> <del>was born.</del></p>\n<h2>Logo</h2>\n<p>The first task I set out for my self was designing the logo. Starting with the logo helps, to set the mood for the rest of my design assets and to define some of the core colors.  </p>\n<h2>First step, blue pencil thumbnails:</h2>\n<p><img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_EDFED05DBCB2B6EF12043DA2FEC46CEA459858785E2CF3D89480A5FD6A951CEE_1551993877443_creatuesIcon.jpg\"></p>\n<h2>Next step slowly refine the design in Adobe Illustrator</h2>\n<p><img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_EDFED05DBCB2B6EF12043DA2FEC46CEA459858785E2CF3D89480A5FD6A951CEE_1551994350195_Logo.png\"></p>\n<p><img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_EDFED05DBCB2B6EF12043DA2FEC46CEA459858785E2CF3D89480A5FD6A951CEE_1551994786933_creatures-icon.png\"></p>\n<h1>🎉 Logos are a fun exercise in refinement and reductive design.</h1>\n<h2>Sketch the layout and hero image</h2>\n<p>The next task I set out for myself is to figure out the layout the website and the hero image. I wanted my site to open up with a large hero illustration, setting the tone for my site. Additionally the illustration gave me an excuse to do some painting 🖌️ 😌 .\n<del>While sketching the layout, I try to keep in mind how users will navigate the site’s pages. My site will</del>\nThe layout for the home page will contain: info explaining the app, an FAQ, and a big shiny button to sign up. The rest of the application’s interface will be links to policy documents and a system to handle scooter management. </p>\n<p><img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_EDFED05DBCB2B6EF12043DA2FEC46CEA459858785E2CF3D89480A5FD6A951CEE_1551995694806_pageDesign4.png\"></p>\n<h2>Paint the hero image</h2>\n<p>The software, I used to make my illustration is: <a href=\"https://sketchbook.com/\">Autodesk Sketchbook</a>, and <a href=\"https://krita.org/en/\">Krita</a> both are free and excellent.</p>\n<p><img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_EDFED05DBCB2B6EF12043DA2FEC46CEA459858785E2CF3D89480A5FD6A951CEE_1551996131476_pageDesign6.png\">\n<img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_EDFED05DBCB2B6EF12043DA2FEC46CEA459858785E2CF3D89480A5FD6A951CEE_1551996174265_lineWorkSm.png\"></p>\n<p><img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_EDFED05DBCB2B6EF12043DA2FEC46CEA459858785E2CF3D89480A5FD6A951CEE_1551996195753_pageDesign8.png\">\n<img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_EDFED05DBCB2B6EF12043DA2FEC46CEA459858785E2CF3D89480A5FD6A951CEE_1551996201151_pageDesign7.png\"></p>\n<p><img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_EDFED05DBCB2B6EF12043DA2FEC46CEA459858785E2CF3D89480A5FD6A951CEE_1551996247124_pageBanner-Web.jpg\"></p>\n<h2>Other site assets</h2>\n<p>After finishing the illustration, I spent some time creating a few little guys to populate my site. </p>\n<p><img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_EDFED05DBCB2B6EF12043DA2FEC46CEA459858785E2CF3D89480A5FD6A951CEE_1552401669352_creature0sm.png\">\n<img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_EDFED05DBCB2B6EF12043DA2FEC46CEA459858785E2CF3D89480A5FD6A951CEE_1552401584169_creature1sm.png\">\n<img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_EDFED05DBCB2B6EF12043DA2FEC46CEA459858785E2CF3D89480A5FD6A951CEE_1552401589476_creature2sm.png\"></p>\n<h2>🔤 Fonts:</h2>\n<p>Fonts are important aspect of a site’s personality. For my fonts, I used <a href=\"https://fonts.google.com/\">Google Fonts</a>,\nthey have a bunch of free fonts to use and you can simply link to their <a href=\"https://en.wikipedia.org/wiki/Content_delivery_network\">CDN</a> so that you do not have to download or install anything.</p>\n<p><a href=\"https://developers.google.com/fonts/docs/getting_started\">Guide to using Google Fonts</a></p>\n<p><strong>I am no typographer, but when choosing fonts I try to follow these guide lines:</strong></p>\n<ul>\n<li>Use serif fonts for large blocks of text.</li>\n<li>Relate your font choices to your theme, do they feel right?</li>\n<li>Use different fonts to signal the reader for different types of info.</li>\n</ul>\n<p><strong>The fonts I used in my app:</strong></p>\n<table>\n<thead>\n<tr>\n<th><a href=\"https://fonts.google.com/specimen/Nunito\">Nunito</a></th>\n<th>primary body text</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><a href=\"https://fonts.google.com/specimen/Nunito+Sans\">Nunito Sans</a></td>\n<td>logo and headers</td>\n</tr>\n<tr>\n<td><a href=\"https://fonts.google.com/specimen/Rokkitt\">Rokkitt</a></td>\n<td>creature descriptions</td>\n</tr>\n</tbody>\n</table>\n<h2>Creature Illustration:</h2>\n<p>The last asset I worked on is an illustration for the first “Creature”. The idea being that when a user scans a scooter it would bring up an illustration and a brief description of the corresponding Creature. My first Creature is “Zi”, an ancient, nebulous , spirit eye… thing 🤔   </p>\n<p><img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_EDFED05DBCB2B6EF12043DA2FEC46CEA459858785E2CF3D89480A5FD6A951CEE_1552410254149_eyeDesign1sm.png\" alt=\"The symmetry option in Adobe Sketchbook proved very useful for quickly creating an interesting shape\">\n<img src=\"https://d2mxuefqeaa7sj.cloudfront.net/s_EDFED05DBCB2B6EF12043DA2FEC46CEA459858785E2CF3D89480A5FD6A951CEE_1552410259442_eyeDesign-web.jpg\"></p>\n<p><strong>Creature description:</strong></p>\n<blockquote>\n<p>One of the ancient elemental creatures, formless, mysterious, and possessing vast power. Many tales and legends surround the origin of this creature. Some worship it as a god (the cult of I) others regard it as an evil spirit or doubt its very existence. Those believed to have gazed upon the creature, are oft heard repeating the phrase: “The eye knows. The eye sees…</p>\n</blockquote>\n<p>With all my assets created, my next step is put them all together into a usable website. Strictly speaking this project did not progress linearly from design to development, but for this guide, we can pretend that it did. In reality both design and development happened simultaneously. </p>\n<p><del>I like logos that have mutiple layers</del></p>\n<p><del></del><del>Logos are a great opportunity to set the theme and the main colors for the brand.</del></p>\n<p><del></del><del>The central idea behind the design of the scooters is that each one would be a unique “creature” and that users would discover them out in the wild.</del> </p>\n<p><del></del><del>Being that I have a background in art</del> </p>\n<p><del></del><del>Working through the tasks I set out for my self</del></p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">  ~~When coming up with ideas for the design of your app it is useful to research how other companies have approached the problem what over companies have done.~~</code></pre></div>\n<p>  <del>My primary exposure to scooter shares was Lime and Bird</del> </p>\n<p><del></del>  <del>I liked the idea of having a custom term for the scooter</del>\n<del>I knew I wanted to replicate that idea and push it further</del></p>\n<p><del></del><del>I knew when I started to brainstorm ideas for my scooter app that as much as possible I wanted to differentiate what I was making from companies already on the market i.e. bird, lime, lyft</del></p>\n<p><del></del><del>I like ideas that are strange.</del>\n<del>When brainstorming ideas for what would eventually become Creatures</del></p>\n<h2>👩‍💻 Development</h2>\n<p>Because people need to be outside to use one of my scooters, I can assume that my site will be visited mostly by mobile devices. That being the case, I will need to decide if I want to develop native mobile apps (andriod, IOS) or just a web app. After doing some research and looking into my project requirements, I found that I did not require any of the added features that a native mobile app provides such as bluetooth, sensor data, flashlight access, etc. By not having to develop native versions of my app should save me a considerable amount of time and heartache.</p>\n<p><del></del><del>In the future, I may invest the time to develop native apps, but for now   Fortunately, forgoing native apps, helps to reduce my workload.</del> </p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">~~~~~~Right from the start I knew that, if possible, I wanted my app to reside solely on the web. I chose to forgo developing native mobile apps primarily to reduce the workload and to flatten my learning curve.  In addition,~~ \n\n\n## 🛠️ Toolkits, Libraries, Frameworks\n\nAn important decision when building a app is what tools will you use to build it. As much as possible, I try to make use of existing frameworks when building a site.\n\n**What I used to build my site is:**\n\n| **Tool**                                                                | **Description / Use**                                                                                                                                                                    |\n| ----------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| [Bootstrap](https://getbootstrap.com/)                                  | Super popular component library, makes it quick and easy to throw together a site                                                                                                        |\n| [SASS](https://sass-lang.com/)                                          | CSS extension, adds some nice extra features to css.                                                                                                                                     |\n| [React](https://reactjs.org/)                                           | My favorite Javascript library                                                                                                                                                           |\n| [Reactstrap](https://reactstrap.github.io/)                             | Ready for React Bootstrap 4 components                                                                                                                                                   |\n| [React Router](https://reacttraining.com/react-router/)                 | A router that makes adding navigation to your react app easier                                                                                                                           |\n| [Font Awesome](https://fontawesome.com/?from=io)                        | Icon Pack - My site relies heavily on emojis, for icons however some times you need something that you cannot find an emoji for.                                                         |\n| [Hero Patterns](http://www.heropatterns.com/)                           | Repeatable SVG patterns to add texture to my site.                                                                                                                                       |\n| [React Stopwatch](https://github.com/slorenzo/react-stopwatch)          | A Stopwatch Component built for React, I need a timer so that users can keep track of their ride time. Building from an existing component is usually faster than starting from scratch. |\n| [React QR Reader](https://github.com/JodusNodus/react-qr-reader#readme) | A QR Reader Component built for React , I need QR reader so that users can scan a qr code on the scooter.                                                                                |\n\n\nI chose the tools I did mostly based previous experience using them. It is always easier to go with what you know.\n\n\n## Create Mock Up:\n\nI started by creating a simple mock up of the site using default bootstrap components.\nThe mock up allowed me to focus on figuring out the logic and navigation of my app before worrying about importing any of my visual assets.\n\n\n![](https://d2mxuefqeaa7sj.cloudfront.net/s_EDFED05DBCB2B6EF12043DA2FEC46CEA459858785E2CF3D89480A5FD6A951CEE_1552585862865_screenGrab.PNG)\n\n## 🗺️ Navigation flows\n\nThe following maps out the paths clients can take when using my app.\nThe ride flow has more steps than I would like, maybe in the future I will look at simplifying the process.\n\n**The signup flow:**\n\n1. User signs up for app by creating a new account\n2. User confirms security code via email.\n3. User is logged in\n\n**Ride flow:**\n\n1. User signs in, if not already signed in.\n2. User navigates to Ride page\n3. User either scans QR or manually enters code.\n4. App presents Creature illustration and description\n  1. If scooter is available, User will have the option to unlock the scooter\n    1. other wise they will need to try again later\n5. After unlock, the app routes to the stopwatch component, with start button\n  1. User clicks on start ride\n6. Ride ends after time limit or user presses stop button.\n## Connect with AWS backend\n\nAt this point in the project, my backend was already setup on AWS.\nTo help connect the API I setup on AWS with my front end I used Amazon’s [Amplify Framework](https://aws-amplify.github.io/)\nAt the time I found the Amplify’s documentation lacking in useful examples. I think the [Amplify section](https://serverless-stack.com/chapters/configure-aws-amplify.html) on the Serverless Stack guide provides a really good example of how to use Amplify.\n\n## Combine mock up with visual assets\n\nThe final step after getting both sides of my app communicating, is to take my working mock up and combine it with the visual assets I made. After a lot fiddling, testing, and breaking stuff, I slowly got every to fit together.  This part of the project was the most tedious part and probably took the longest period of time to complete.\n\nTo see the “final product”, visit:\nhttps://creature-share.com/\n\n## Configure to use Netlify\n\nOne last step for my site is to set it up for hosting on [Netlify](https://www.netlify.com/)\nI could have used AWS for hosting, which seems like a natural fit because my backend is already on AWS, however I found Netlify better for these reasons:\n\n- Automated deployments - I only need to push to a git repo to deploy a new version of my site. \n- Automatic SSL is a lot easier than manually creating one with [AWS Certificate Manager](https://aws.amazon.com/certificate-manager/).\n- Builtin CDN, [AWS cloud front](https://aws.amazon.com/certificate-manager/) can pain in the ass to setup, with Netlify you don’t have to do anything to setup your site on a CDN.\n\n~~The reason I chose to use Netlify over using AWS (which seems like a natural fit because my backend is already on AWS) is:~~\n\n- ~~I found~~ \n\n~~I advantage for app in using Netlify over AWS for hosting~~ \n\n~~~~~~Created FAQ component~~\n\n~~~~~~User signin was problematic~~\n~~amplify docs~~ \n\n\n## 🏁 Conclusion / Final steps\n\nI hope this “guide” was informative, and possibly inspirational. At this point I have a working proof of concept site. The next step for this project is to figure out the scooter hardware and get it communicating with our app. My site is by no means a production ready app. I purposelessly left out necessary features like payment, because I do not currently intend to try to make my app into a working business. For me, the purpose of making Creatures was to learn and have fun. However, if I was going to try to make a production ready site, here are some things I would try to implement:\n\n\n## 😐 Current Issues / Improvements:\n  [ ] Provide users the ability to delete their account.\n  [ ] Allow users to see ride statistics, ride history, creatures ridden\n  [ ] Allow users to locate Creatures via a map interface\n  [ ] Add Payment / Charity option\n  [ ] Provide a more granular time keeping / billing logic\n  [ ] Allow users to see the battery level of scooter\n  [ ] Provide users the ability to have the Creature make a chirp sound to aid in locating it. \n\nIf you are interested in starting your own scooter share, take a look at my github repo for the project. The repo contains all the source code for the project and documentation on using said code. \n\n~~I used~~ [~~bootstrap~~](https://getbootstrap.com/) ~~because of my~~ ~~familiarity~~ ~~with it~~ \n\n\n~~~~~~Bird, Lime, Etc.~~\n\n- ~~Locate scooters on Map~~\n- ~~User can scan qr code with camera~~\n- ~~User can manually enter code~~ \n- ~~History of Rides~~\n- ~~Have the scooter make a sound to help with locating~~\n- ~~User can see current battery level~~\n- ~~QR scanner can turn on flashlight to help with scanning~~\n- ~~User can report problems with scooters~~\n\n\n## ~~💣 Testing / QA~~ \n\n\n\n## \n\n\n# ~~🙂 Implementation~~ ~~How they can replicate what I did~~</code></pre></div>\n<p><del>video</del> </p>\n<h2><del>🎨 Branding / Design</del></h2>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">## ~~👩‍💻 Create a Website or App~~</code></pre></div>\n<h2><del>💣 Testing / QA</del></h2>","frontmatter":{"title":"FrontEnd Guide","date":"Invalid date"}}},"pageContext":{"slug":"/frontend/","previous":{"fields":{"slug":"/hardware-options/"},"frontmatter":{"title":"Hardware Options"}},"next":null}}